# Edulyt Project- Credit Banking_Project1

### -Sriram Kumar
###  EI01012

In [1]:
import pandas as pd
import numpy as np

In [2]:
certi=pd.read_csv("E:\Edulyt Projects\Proj 1\certification.csv",index_col=0)
certi.head()

,Customer,Age,City,Credit Card Product,Limit,Company,Segment,AGE main,SpendAmt,ReptAmt,AgeGrp
Sl No:,,,,,,,,,,,
1,A1,0.9285,BANGALORE,Gold,500000,C1,Self Employed,49.29,4858294.33,3831937.75,40-50
2,A2,35.5346,CALCUTTA,Silver,100000,C2,Salaried_MNC,35.53,3151947.44,3653252.17,30-40
3,A3,11.5593,COCHIN,Platimum,10000,C3,Salaried_Pvt,49.29,2871164.31,2055044.10,40-50
4,A4,45.8203,BOMBAY,Platimum,10001,C4,Govt,45.82,3121668.97,2507424.49,40-50
5,A5,69.6639,BANGALORE,Platimum,10002,C5,Normal Salary,69.66,4816555.21,5125186.89,60-70

In [85]:
spend=pd.read_csv("E:\Edulyt Projects\Proj 1\spend.csv",index_col=0)
spend.head()

       Customer      Month Monthh  Year       Type  Spend Amount
Sl No:
1            A1  12-Jan-04  01Jan  2004  JEWELLERY     473775.83
2            A1  03-Jan-04  01Jan  2004      PETRO     335578.67
3            A1  15-Jan-04  01Jan  2004    CLOTHES     371040.94
4            A1  25-Jan-04  01Jan  2004       FOOD     141177.81
5            A1  17-Jan-05  01Jan  2005     CAMERA     398403.77

In [78]:
repayment=pd.read_csv(r"E:\Edulyt Projects\Proj 1\repayment.csv",index_col=0)
repayment.head()

       Customer      Month Monthh  Year  Repayment Amount
SL No:
1            A1  12-Jan-04  01Jan  2004         331844.01
2            A1  03-Jan-04  01Jan  2004         441139.81
3            A1  15-Jan-04  01Jan  2004          32480.00
4            A1  25-Jan-04  01Jan  2004          90636.97
5            A1  17-Jan-05  01Jan  2005           1581.97

## Monthly Spend of each Customer

In [102]:
spend.groupby(['Customer','Year','Monthh']).sum()['Spend Amount']

Customer  Year  Monthh
A1        2004  01Jan     1511172.74
                02Feb       41381.11
                05May      131196.59
          2005  01Jan      398403.77
                02Feb     1404193.04
                             ...
A95       2004  01Jan      347833.88
A96       2004  01Jan      320363.54
A97       2004  01Jan      164330.04
A98       2004  01Jan       87483.51
A99       2004  01Jan      476020.39
Name: Spend Amount, Length: 807, dtype: float64

## Monthly Repayment of each Customer

In [103]:
repayment.groupby(['Customer','Year','Monthh']).sum()['Repayment Amount']

Customer  Year  Monthh
A1        2004  01Jan     1362775.24
                02Feb      191180.01
          2005  01Jan        1581.97
                02Feb     1199807.63
                07Jul      300581.70
                             ...
A95       2004  01Jan       75109.49
A96       2004  01Jan      110139.01
A97       2004  01Jan      174606.39
A98       2004  01Jan       97802.60
A99       2004  01Jan      358589.92
Name: Repayment Amount, Length: 798, dtype: float64

## 10 Highest paying Customers

In [5]:
certi.sort_values(by=['ReptAmt']).tail(10)[['Customer','ReptAmt']][::-1]

       Customer     ReptAmt
Sl No:
22          A22  9767170.68
60          A60  9262032.37
61          A61  8807888.34
40          A40  8805084.90
47          A47  8529825.86
43          A43  8458621.33
48          A48  8432803.66
41          A41  8374045.76
49          A49  8259840.55
45          A45  8115209.87

## Maximum Spending Segment

In [6]:
certi.groupby('Segment')[['Segment','SpendAmt']].sum().sort_values(by=['SpendAmt'])[::-1].head(1)

                   SpendAmt
Segment
Normal Salary  1.077071e+08

## Maximum Spending Age Group

In [7]:
certi.groupby('AgeGrp')[['AgeGrp','SpendAmt']].sum().sort_values(by=['SpendAmt'])[::-1].head(1)

            SpendAmt
AgeGrp
40-50   1.357128e+08

## Category wise Maximum Spending (Segment, Age Group, City, Credit Card Product, Company,Type)

### 1. Maximum Spending Segment

In [8]:
certi.groupby('Segment')[['Segment','SpendAmt']].sum().sort_values(by=['SpendAmt'])[::-1].head(1)

                   SpendAmt
Segment
Normal Salary  1.077071e+08

### 2. Maximum Spending Age Group

In [9]:
certi.groupby('AgeGrp')[['AgeGrp','SpendAmt']].sum().sort_values(by=['SpendAmt'])[::-1].head(1)

            SpendAmt
AgeGrp
40-50   1.357128e+08

### 3. Maximum Spending City

In [10]:
certi.groupby('City')[['City','SpendAmt']].sum().sort_values(by=['SpendAmt'])[::-1].head(1)

           SpendAmt
City
COCHIN  78892999.38

### 4. Maximum Spending Credit Card Product

In [11]:
certi.groupby('Credit Card Product')[['Credit Card Product','SpendAmt']].sum().sort_values(by=['SpendAmt'])[::-1].head(1)

                         SpendAmt
Credit Card Product
Gold                 1.512157e+08

### 5. Maximum Spending Company

In [12]:
certi.groupby('Company')[['Company','SpendAmt']].sum().sort_values(by=['SpendAmt'])[::-1].head(1)

            SpendAmt
Company
C22      29026550.08

### 6. Maximum Spending Type

In [76]:
spend.groupby('Type')[['Type','Spend Amount']].sum().sort_values(by=['Spend Amount'],ascending=False).head(1)

       Spend Amount
Type
PETRO    51022582.7

# Profit Values

Step1: Merging Certification and Spend tables

In [86]:
common_table=pd.merge(certi,spend,on='Customer',how='outer')
common_table.head()

,Customer,Age,City,Credit Card Product,Limit,Company,Segment,AGE main,SpendAmt,ReptAmt,AgeGrp,Month,Monthh,Year,Type,Spend Amount
0,A1,0.9285,BANGALORE,Gold,500000,C1,Self Employed,49.29,4858294.33,3831937.75,40-50,12-Jan-04,01Jan,2004,JEWELLERY,473775.83
1,A1,0.9285,BANGALORE,Gold,500000,C1,Self Employed,49.29,4858294.33,3831937.75,40-50,03-Jan-04,01Jan,2004,PETRO,335578.67
2,A1,0.9285,BANGALORE,Gold,500000,C1,Self Employed,49.29,4858294.33,3831937.75,40-50,15-Jan-04,01Jan,2004,CLOTHES,371040.94
3,A1,0.9285,BANGALORE,Gold,500000,C1,Self Employed,49.29,4858294.33,3831937.75,40-50,25-Jan-04,01Jan,2004,FOOD,141177.81
4,A1,0.9285,BANGALORE,Gold,500000,C1,Self Employed,49.29,4858294.33,3831937.75,40-50,17-Jan-05,01Jan,2005,CAMERA,398403.77

Step2: Merging Certification and Repayment tables

In [80]:
common_table2=pd.merge(certi,repayment,on='Customer',how='outer')
common_table2.head()

,Customer,Age,City,Credit Card Product,Limit,Company,Segment,AGE main,SpendAmt,ReptAmt,AgeGrp,Month,Monthh,Year,Repayment Amount
0,A1,0.9285,BANGALORE,Gold,500000,C1,Self Employed,49.29,4858294.33,3831937.75,40-50,12-Jan-04,01Jan,2004,331844.01
1,A1,0.9285,BANGALORE,Gold,500000,C1,Self Employed,49.29,4858294.33,3831937.75,40-50,03-Jan-04,01Jan,2004,441139.81
2,A1,0.9285,BANGALORE,Gold,500000,C1,Self Employed,49.29,4858294.33,3831937.75,40-50,15-Jan-04,01Jan,2004,32480.00
3,A1,0.9285,BANGALORE,Gold,500000,C1,Self Employed,49.29,4858294.33,3831937.75,40-50,25-Jan-04,01Jan,2004,90636.97
4,A1,0.9285,BANGALORE,Gold,500000,C1,Self Employed,49.29,4858294.33,3831937.75,40-50,17-Jan-05,01Jan,2005,1581.97

Step3: Grouping both the tables per customer per month including Limit and Segment columns

In [90]:
comonS=common_table.groupby(['Customer','Limit','Segment','Year','Monthh']).sum()['Spend Amount']
comonS.head()

Customer  Limit   Segment        Year  Monthh
A1        500000  Self Employed  2004  01Jan     1511172.74
                                       02Feb       41381.11
                                       05May      131196.59
                                 2005  01Jan      398403.77
                                       02Feb     1404193.04
Name: Spend Amount, dtype: float64

In [89]:
comonR=common_table2.groupby(['Customer','Limit','Segment','Year','Monthh']).sum()['Repayment Amount']
comonR.head()

Customer  Limit   Segment        Year  Monthh
A1        500000  Self Employed  2004  01Jan     1362775.24
                                       02Feb      191180.01
                                 2005  01Jan        1581.97
                                       02Feb     1199807.63
                                       07Jul      300581.70
Name: Repayment Amount, dtype: float64

Step4: Merging the grouped tables on outer join, to get the missing values

In [91]:
main_c_table1=pd.merge(comonS,comonR,on=['Customer','Year','Monthh','Limit','Segment'],how='outer')
main_c_table1.head()

                                           Spend Amount  Repayment Amount
Customer Year Monthh Limit  Segment
A1       2004 01Jan  500000 Self Employed    1511172.74        1362775.24
              02Feb  500000 Self Employed      41381.11         191180.01
              05May  500000 Self Employed     131196.59               NaN
         2005 01Jan  500000 Self Employed     398403.77           1581.97
              02Feb  500000 Self Employed    1404193.04        1199807.63

Step5: Re-importing the main merged table in order to convert Limit and Segment into columns

In [92]:
main_c_table1.to_csv('mt1')

In [2]:
mt1=pd.read_csv('mt1.csv')
mt1.head()

  Customer  Year Monthh   Limit        Segment  Spend Amount  Repayment Amount
0       A1  2004  01Jan  500000  Self Employed    1511172.74        1362775.24
1       A1  2004  02Feb  500000  Self Employed      41381.11         191180.01
2       A1  2004  05May  500000  Self Employed     131196.59               NaN
3       A1  2005  01Jan  500000  Self Employed     398403.77           1581.97
4       A1  2005  02Feb  500000  Self Employed    1404193.04        1199807.63

Step6: Replacing null vallues with 0

In [3]:
mt1.fillna(0,inplace=True)

Step7: Applying Credit and Intrest amount on the customers per month with the help of a user defined function

In [4]:
def Action(r,s,l):
    if r>s:
        return -0.02*l
    else:
        return 0.029*(s-r)

Step8: Introducing a new column 'Profit' which contains the calculated value given by the funtion used

In [5]:
mt1['Profit']=mt1.apply(lambda x:Action(x['Repayment Amount'],x['Spend Amount'],x['Limit']),axis=1)

In [6]:
mt1.head()

,Customer,Year,Monthh,Limit,Segment,Spend Amount,Repayment Amount,Profit
0,A1,2004,01Jan,500000,Self Employed,1511172.74,1362775.24,4303.52750
1,A1,2004,02Feb,500000,Self Employed,41381.11,191180.01,-10000.00000
2,A1,2004,05May,500000,Self Employed,131196.59,0.00,3804.70111
3,A1,2005,01Jan,500000,Self Employed,398403.77,1581.97,11507.83220
4,A1,2005,02Feb,500000,Self Employed,1404193.04,1199807.63,5927.17689

## Most Profitable Segment

In [9]:
Seg_Prof=mt1.groupby('Segment').sum()['Profit']

In [10]:
Seg_Prof[Seg_Prof==Seg_Prof.max()]

Segment
Normal Salary    656033.39099
Name: Profit, dtype: float64

## Monthly Profit of the Bank

In [15]:
mt1.groupby(['Year','Monthh']).sum()['Profit']

Year  Monthh
2004  01Jan     408523.08802
      02Feb      96515.60473
      03Mar      41346.31386
      04Apr      57058.96681
      05May       1254.37583
      09Sep      29144.15163
      11Nov      39429.55727
2005  01Jan      44564.68842
      02Feb     207085.44582
      04Apr      57960.17094
      05May      79476.32311
      06Jun     164566.33891
      07Jul      16596.32366
      08Aug      28086.36166
      09Sep      46081.99374
      10Oct      29211.67160
      11Nov     140355.38085
      12Dec      20985.16998
2006  01Jan      34424.25225
      02Feb      74721.08243
      03Mar     263787.00748
      04Apr     205504.41198
      05May     -30569.33178
      06Jun      28025.07899
      07Jul      42034.84974
      08Aug       4692.80945
      09Sep      32836.23849
      10Oct       2489.94014
      11Nov      89997.71483
      12Dec      12400.55385
Name: Profit, dtype: float64